Documents/ВнутреннееПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ВнутреннееПеремещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОтпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПродукцияИСырье</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПартии</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВнутреннееПеремещение/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура Накладная(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.ВнутреннееПеремещение.ПолучитьМакет("Накладная");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВнутреннееПеремещение.Автор КАК Автор,
		|	ВнутреннееПеремещение.Дата КАК Дата,
		|	ВнутреннееПеремещение.Номер КАК Номер,
		|	ВнутреннееПеремещение.СкладОтправитель КАК СкладОтправитель,
		|	ВнутреннееПеремещение.СкладПолучатель КАК СкладПолучатель,
		|	ВнутреннееПеремещение.ПродукцияИСырье.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Номенклатура.ЕдиницыИзмерения.Наименование КАК ЕдиницыИзмерения
		|	) КАК Номенклатура,
		|	ВнутреннееПеремещение.ОснованиеОтпуска КАК ОснованиеОтпуска
		|ИЗ
		|	Документ.ВнутреннееПеремещение КАК ВнутреннееПеремещение
		|ГДЕ
		|	ВнутреннееПеремещение.Ссылка В(&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьНоменклатураШапка = Макет.ПолучитьОбласть("НоменклатураШапка");
		ОбластьНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.Заполнить(Выборка);
			ОбластьЗаголовок.Параметры.НаименованиеОрганизации = ОбщегоНазначенияСервер.ПолучитьНаименованиеОрганизации();
			ОбластьЗаголовок.Параметры.УНПОрганизации = Константы.УНП.Получить();
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.ФорматированнаяДата = Формат(Выборка.Дата, "ДЛФ=ДД");
			Шапка.Параметры.Кому = Выборка.СкладПолучатель.ВладелецСклада.Наименование;
			Шапка.Параметры.ОтКого = Выборка.СкладОтправитель.ВладелецСклада.Наименование;
			Шапка.Параметры.Куда = Выборка.СкладПолучатель.ОбъектПроизводства.Наименование;
			Шапка.Параметры.Откуда = Выборка.СкладОтправитель.ОбъектПроизводства.Наименование;
			
			
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьНоменклатураШапка);
			ВыборкаНоменклатура = Выборка.Номенклатура.Выбрать();
			Пока ВыборкаНоменклатура.Следующий() Цикл
				ОбластьНоменклатура.Параметры.Заполнить(ВыборкаНоменклатура);
				ТабДок.Вывести(ОбластьНоменклатура, ВыборкаНоменклатура.Уровень());
				КоличествоСтрок = ВыборкаНоменклатура.НомерСтроки;
			КонецЦикла;
			
			Подвал.Параметры.Заполнить(Выборка);
			Подвал.Параметры.Строки = КоличествоСтрок;
			Подвал.Параметры.ОтпускРазрешилДолжность = Константы.НачальникПроизводства.Получить().Должность.Наименование;
			Подвал.Параметры.ОтпускРазрешилФИО = Константы.НачальникПроизводства.Получить().Наименование;
			Подвал.Параметры.ОтпустилДолжность = Выборка.СкладОтправитель.ВладелецСклада.Должность.Наименование;
			Подвал.Параметры.ОтпустилФИО = Выборка.СкладОтправитель.ВладелецСклада.Наименование;
			Подвал.Параметры.ПолучилДолжность = Выборка.СкладПолучатель.ВладелецСклада.Должность.Наименование;
			Подвал.Параметры.ПолучилФИО = Выборка.СкладПолучатель.ВладелецСклада.Наименование;
			
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли
КонецПроцедуры
#КонецОбласти
